# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [4]:
import pandas as pd
d = pd.read_csv('baby_names.csv')
d.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [5]:
d.drop(['Unnamed: 0', 'Id'], axis=1)

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
...       ...   ...    ...   ...    ...
2498    Devin  2004      M    AK     12
2499     Liam  2004      M    AK     12
2500     Paul  2004      M    AK     12
2501  Richard  2004      M    AK     12
2502  Trenton  2004      M    AK     12

[2503 rows x 5 columns]

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [9]:
import pandas as pd
baby_names = pd.read_csv("baby_names.csv")
print(baby_names)

      Unnamed: 0     Id     Name  Year Gender State  Count
0          11349  11350     Emma  2004      F    AK     62
1          11350  11351  Madison  2004      F    AK     48
2          11351  11352   Hannah  2004      F    AK     46
3          11352  11353    Grace  2004      F    AK     44
4          11353  11354    Emily  2004      F    AK     41
...          ...    ...      ...   ...    ...   ...    ...
2498       24170  24171    Devin  2004      M    AK     12
2499       24171  24172     Liam  2004      M    AK     12
2500       24172  24173     Paul  2004      M    AK     12
2501       24173  24174  Richard  2004      M    AK     12
2502       24174  24175  Trenton  2004      M    AK     12

[2503 rows x 7 columns]

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [10]:
print(baby_names.head(10))

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [12]:
baby_names.drop(["Unnamed: 0", "Id"], axis = 1)

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
...       ...   ...    ...   ...    ...
2498    Devin  2004      M    AK     12
2499     Liam  2004      M    AK     12
2500     Paul  2004      M    AK     12
2501  Richard  2004      M    AK     12
2502  Trenton  2004      M    AK     12

[2503 rows x 5 columns]

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [31]:
baby_names['Gender'].value_counts()

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [59]:
x = baby_names.drop(["Year"], axis = 1)
print (x)
print ("\n")
names = baby_names.groupby("Name")
print(names)

      Unnamed: 0     Id     Name Gender State  Count
0          11349  11350     Emma      F    AK     62
1          11350  11351  Madison      F    AK     48
2          11351  11352   Hannah      F    AK     46
3          11352  11353    Grace      F    AK     44
4          11353  11354    Emily      F    AK     41
...          ...    ...      ...    ...   ...    ...
2498       24170  24171    Devin      M    AK     12
2499       24171  24172     Liam      M    AK     12
2500       24172  24173     Paul      M    AK     12
2501       24173  24174  Richard      M    AK     12
2502       24174  24175  Trenton      M    AK     12

[2503 rows x 6 columns]


<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002641E10FA48>

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [51]:
x = baby_names.groupby("Name").sum()
print (x["Count"])

Name
Aaliyah    117
Aaron       29
Abby        12
Abigail    392
Ada          5
          ...
Wyatt       20
Xander      13
Zachary     27
Zoe        159
Zoey       154
Name: Count, Length: 575, dtype: int64

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [52]:
print (x["Count"].max())

561

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [53]:
print (x["Count"].median())

24.0

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [44]:
print(baby_names.describe())

         Unnamed: 0            Id         Year        Count
count   2503.000000   2503.000000  2503.000000  2503.000000
mean   13008.300839  13009.300839  2008.895326    11.485018
std     2356.700693   2356.700693     3.252164     8.830294
min    11349.000000  11350.000000  2004.000000     5.000000
25%    11974.500000  11975.500000  2006.000000     6.000000
50%    12600.000000  12601.000000  2009.000000     8.000000
75%    13225.500000  13226.500000  2012.000000    13.000000
max    24174.000000  24175.000000  2014.000000    65.000000